In [2]:
import pandas as pd
df = pd.read_csv(r"precios_semana_20200518.csv", sep="|", encoding="Latin-1")
df.head()

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

In [3]:
contador=df.isnull().sum()
contador

precio         1960
producto_id       6
sucursal_id       6
dtype: int64

In [4]:
#rellena los datos nulos, en base al valor de la siguiente fila.
df=df.fillna(method="bfill")

In [5]:
contador=df.isnull().sum()
contador

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [6]:
#cambiamos de "." a ","
for i, elemento in enumerate(df['precio']):
   df['precio'][i] = str(df['precio'][i])
   #Transformaciones en los campos numéricos
for i, elemento in enumerate(df['precio']):
   elemento = elemento.replace('.', ',')
   df['precio'][i] = elemento

C:\Users\HP SUPPORT\AppData\Local\Temp\ipykernel_3432\219681451.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['precio'][i] = str(df['precio'][i])

In [7]:
df.head()

   precio    producto_id sucursal_id
0    29,9  0000000002288     2-1-009
1    32,9  0000000002288     2-1-037
2    36,9  0000000002288     2-1-090
3    39,9  0000000002288     2-3-247
4  499,99  0000000205870     9-1-430

In [8]:
df.to_csv('precios_semana_20200518_ok.csv', index=False)

In [50]:
df.sample(100)

        precio        producto_id sucursal_id
101784   259,9      7790139003142       8-1-8
167679   70,89      7790670051060     7-2-802
286232    85,0      7793147000882   16-1-1402
414497   499,0  9-3-0000000154840    9-3-5222
124849  125,99      7790314056109      25-1-1
...        ...                ...         ...
42015     91,0      7506174512248     2-1-037
207402   17,98      7791249792001      47-1-3
58329     65,9      7622300249014      49-1-2
369737   79,99      7798124780085      25-1-1
336692    54,9      7796373002156      46-1-3

[100 rows x 3 columns]